spec/vcr_cassettes/PayPalPurchasesCart/successful_credit_card_purchase/updates_the_ticket_status.yml

---
http_interactions:
- request:
    method: post
    uri: https://EBWKjlELKMYqRNQ6sYvFo64FtaRLRR5BdHEESmha49TM:EO422dn3gQLgDbuwqTjzrFgFtaRLRR5BdHEESmha49TM@api.sandbox.paypal.com/v1/oauth2/token
    body:
      encoding: UTF-8
      string: grant_type=client_credentials
    headers:
      User-Agent:
      - PayPalSDK/PayPal-Ruby-SDK 1.4.1 (paypal-sdk-core 1.4.1; ruby 2.3.0p0-x86_64-darwin15;OpenSSL
        1.0.2e 3 Dec 2015)
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 03 Mar 2016 02:28:12 GMT
      Server:
      - Apache
      Proxy-Server-Info:
      - host=slcsbplatformapiserv3002.slc.paypal.com;threadId=349
      Paypal-Debug-Id:
      - b963828d8f185
      - b963828d8f185
      Correlation-Id:
      - b963828d8f185
      X-Paypal-Token-Service:
      - IAAS
      Content-Length:
      - '449'
      Set-Cookie:
      - X-PP-SILOVER=; Expires=Thu, 01 Jan 1970 00:00:01 GMT
      - X-PP-SILOVER=name%3DSANDBOX3.API.1%26silo_version%3D1880%26app%3Dplatformapiserv%26TIME%3D1017239382;
        domain=.paypal.com; path=/; Secure; HttpOnly
      Vary:
      - Authorization
      Connection:
      - close
      Content-Type:
      - application/json
    body:
      encoding: UTF-8
      string: '{"scope":"https://api.paypal.com/v1/payments/.* https://api.paypal.com/v1/vault/credit-card
        openid https://api.paypal.com/v1/developer/.* https://api.paypal.com/v1/vault/credit-card/.*","nonce":"2016-03-03T02:00:57ZoWbjX9uod4nCQanyE3KH_qI69zDGHmaWU9Y9f6l1RN4","access_token":"A101.UV5aDq444xj-9GAMkMz6NUKJM-GRNN-A4nOoO4PyPwF6y47t4eqG4r5zx1nO-MIs.SmRo1v7JvFTZboL4KTPvrEh5YSa","token_type":"Bearer","app_id":"APP-2EJ531395M785864S","expires_in":30765}'
    http_version: 
  recorded_at: Thu, 03 Mar 2016 02:28:12 GMT
- request:
    method: post
    uri: https://api.sandbox.paypal.com/v1/payments/payment
    body:
      encoding: UTF-8
      string: '{"intent":"sale","payer":{"payment_method":"paypal"},"transactions":[{"amount":{"currency":"USD","total":"30.00"},"item_list":{"items":[{"quantity":"1","price":"15.00","currency":"USD"},{"quantity":"1","price":"15.00","currency":"USD"}]}}],"redirect_urls":{"return_url":"http://localhost:3000/paypal/approved","cancel_url":"http://localhost:3000/paypal/rejected"}}'
    headers:
      X-Paypal-Sandbox-Email-Address:
      - Platform.sdk.seller@gmail.com
      Authorization:
      - Bearer A101.UV5aDq444xj-9GAMkMz6NUKJM-GRNN-A4nOoO4PyPwF6y47t4eqG4r5zx1nO-MIs.SmRo1v7JvFTZboL4KTPvrEh5YSa
      Content-Type:
      - application/json
      User-Agent:
      - PayPalSDK/PayPal-Ruby-SDK 1.4.1 (paypal-sdk-core 1.4.1; ruby 2.3.0p0-x86_64-darwin15;OpenSSL
        1.0.2e 3 Dec 2015)
      Paypal-Request-Id:
      - ecb67c62-bf01-4784-bf23-c12e441b139a
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Thu, 03 Mar 2016 02:28:13 GMT
      Server:
      - Apache
      Proxy-Server-Info:
      - host=slcsbplatformapiserv3001.slc.paypal.com;threadId=453
      Paypal-Debug-Id:
      - 54ab661a531be
      - 54ab661a531be
      Correlation-Id:
      - 54ab661a531be
      Content-Language:
      - "*"
      Content-Length:
      - '757'
      Set-Cookie:
      - X-PP-SILOVER=; Expires=Thu, 01 Jan 1970 00:00:01 GMT
      - X-PP-SILOVER=name%3DSANDBOX3.API.1%26silo_version%3D1880%26app%3Dplatformapiserv%26TIME%3D1034016598;
        domain=.paypal.com; path=/; Secure; HttpOnly
      Vary:
      - Authorization
      Connection:
      - close
      Content-Type:
      - application/json
    body:
      encoding: UTF-8
      string: '{"id":"PAY-5VA29950MK018324AK3L2CPI","intent":"sale","state":"created","payer":{"payment_method":"paypal"},"transactions":[{"amount":{"total":"30.00","currency":"USD"},"item_list":{"items":[{"price":"15.00","currency":"USD","quantity":1},{"price":"15.00","currency":"USD","quantity":1}]},"related_resources":[]}],"create_time":"2016-03-03T02:28:13Z","links":[{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-5VA29950MK018324AK3L2CPI","rel":"self","method":"GET"},{"href":"https://www.sandbox.paypal.com/cgi-bin/webscr?cmd=_express-checkout&token=EC-2MN14186UW7826839","rel":"approval_url","method":"REDIRECT"},{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-5VA29950MK018324AK3L2CPI/execute","rel":"execute","method":"POST"}]}'
    http_version: 
  recorded_at: Thu, 03 Mar 2016 02:28:13 GMT
recorded_with: VCR 3.0.1
